# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'


# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some OS X tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'awscli'
brew 'git'
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'node'
brew 'trash'
brew 'wget'

# PHP
brew 'php70', args: ['with-debug', 'without-apache']

# Apps
cask 'fish'
cask 'alfred'
cask 'google-chrome'
cask 'iterm2'
cask 'phpstorm'
cask 'sequel-pro'
cask 'sqleditor'
cask 'slack'
cask 'sublime-text3'
cask 'tower'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'


# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'
